src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.Реализация</basedOn>
  <basedOn>Document.ПоступлениеТоваровИУслуг</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступленияДенег</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровИУслуг</types>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОперацийПоступленияДенег/ВидыОперацийПоступленияДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступленияДенег</name>
  <enumValues>
    <name>ОплатаОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПодотчетника</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРожденияКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолКлиента</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ПриходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
// Форма документа "ПриходныйКассовыйОрдер".
// Обеспечивает:
//   - установку ответственного по умолчанию (текущий пользователь),
//   - динамическое управление типом плательщика (контрагент или сотрудник) в зависимости от вида операции,
//   - управление видимостью поля "Договор" (скрыто для возвратов от подотчетника и для покупателей),
//   - проверку, является ли контрагент покупателем, для скрытия договора.

// ============================================================
//  Серверные обработчики и функции
// ============================================================

// При создании нового документа на сервере:
//   - заполняем ответственного текущим пользователем, если не задан,
//   - настраиваем начальную видимость элементов.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Заполнение ответственного текущим пользователем
    Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
        Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
    
    // Установка начальной видимости элементов формы
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры

// Проверяет, является ли контрагент покупателем.
// Параметры:
//   СсылкаНаКонтрагента – СправочникСсылка.Контрагенты (может быть пустой ссылкой).
// Возвращает:
//   Истина  – если тип контрагента = Покупатель,
//   Ложь    – в противном случае или если ссылка не заполнена.
&НаСервере
Функция КонтрагентПокупатель(СсылкаНаКонтрагента) Экспорт
    Если Не ЗначениеЗаполнено(СсылкаНаКонтрагента) Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Контрагенты.ТипКонтрагента = &ТипПокупатель КАК Покупатель
    |ИЗ
    |    Справочник.Контрагенты КАК Контрагенты
    |ГДЕ
    |    Контрагенты.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаКонтрагента);
    Запрос.УстановитьПараметр("ТипПокупатель", Перечисления.ТипыКонтрагентов.Покупатель);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Покупатель;
    КонецЕсли;
    
    Возврат Ложь;
КонецФункции

// Управляет видимостью элемента "Договор" на сервере.
// Логика:
//   - Возврат от подотчетника → договор скрыт,
//   - Иначе: если плательщик – контрагент и он покупатель → скрыт,
//            иначе (поставщик, пусто или сотрудник) → показан.
&НаСервере
Процедура УправлятьВидимостьюЭлементовНаСервере()
    Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника Тогда
        Элементы.Договор.Видимость = Ложь;
    Иначе
        Если ЗначениеЗаполнено(Объект.Плательщик) И 
            ТипЗнч(Объект.Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда
            ЯвляетсяПокупателем = КонтрагентПокупатель(Объект.Плательщик);
            Элементы.Договор.Видимость = Не ЯвляетсяПокупателем;
        Иначе
            Элементы.Договор.Видимость = Истина;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

// ============================================================
//  Клиентские обработчики
// ============================================================

// При изменении вида операции перестраиваем тип плательщика и видимость.
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
    УправлятьТипомПлательщикаНаКлиенте();
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры

// Устанавливает ограничение типа для реквизита "Плательщик" в зависимости от вида операции:
//   - Возврат от подотчетника → только справочник "Сотрудники",
//   - Остальные виды операций → только справочник "Контрагенты".
// Если текущее значение не соответствует новому типу, оно сбрасывается.
&НаКлиенте
Процедура УправлятьТипомПлательщикаНаКлиенте()
    // В зависимости от вида операции устанавливаем допустимый тип для реквизита Плательщик
    Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
        // Плательщик - Сотрудники
        Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
        // Очищаем значение, если было неверного типа
        Если Объект.Плательщик <> Неопределено И
            ТипЗнч(Объект.Плательщик) <> Тип("СправочникСсылка.Сотрудники") Тогда
            Объект.Плательщик = Неопределено;
        КонецЕсли;
    Иначе
        // Плательщик - Контрагенты
        Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
        Если Объект.Плательщик <> Неопределено И
            ТипЗнч(Объект.Плательщик) <> Тип("СправочникСсылка.Контрагенты") Тогда
            Объект.Плательщик = Неопределено;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

// При изменении плательщика обновляем видимость договора.
&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры

// При открытии формы настраиваем тип плательщика и видимость.
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
    УправлятьТипомПлательщикаНаКлиенте();
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры
